Revit 2027 API
Gradient Class
 A static class that provides access to the property names that appear in the Gradient visual asset schema.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Gradient
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class Gradient
Public NotInheritable Class Gradient
public ref class Gradient abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type Gradient = class end
The Gradient type exposes the following members.
Properties
Name | Description
GradientColor |  The property labeled "Color" from the "Gradient" schema.
GradientInterpolation |  The property labeled "Interpolation" from the "Gradient" schema.
GradientNoise |  The property labeled "Noise Type" from the "Gradient" schema.
GradientNoiseAmount |  The property labeled "Amount" from the "Gradient" schema.
GradientNoiseHigh |  The property labeled "High" from the "Gradient" schema.
GradientNoiseLevels |  The property labeled "Levels" from the "Gradient" schema.
GradientNoiseLow |  The property labeled "Low" from the "Gradient" schema.
GradientNoisePhase |  The property labeled "Phase" from the "Gradient" schema.
GradientNoiseSize |  The property labeled "Size" from the "Gradient" schema.
GradientNoiseSmooth |  The property labeled "Smooth" from the "Gradient" schema.
GradientPosition |  The property labeled "Position" from the "Gradient" schema.
GradientType |  The property labeled "Gradient Type" from the "Gradient" schema.
TextureLinkTextureTransforms |  The property labeled "Link Transforms" from the "Gradient" schema.
TextureOffsetLock |  The property labeled "Offset Lock" from the "Gradient" schema.
TextureRealWorldOffsetX |  The property labeled "Offset X" from the "Gradient" schema.
TextureRealWorldOffsetY |  The property labeled "Offset Y" from the "Gradient" schema.
TextureRealWorldScaleX |  The property labeled "Size X" from the "Gradient" schema.
TextureRealWorldScaleY |  The property labeled "Size Y" from the "Gradient" schema.
TextureScaleLock |  The property labeled "Scale Lock" from the "Gradient" schema.
TextureURepeat |  The property labeled "U Repeat" from the "Gradient" schema.
TextureVRepeat |  The property labeled "V Repeat" from the "Gradient" schema.
TextureWAngle |  The property labeled "Angle" from the "Gradient" schema.
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace